---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
source: html/714a2bf9-184d-c78b-1f7c-8dea1014b165.htm
---
# RebarShapeConstraintAngleFromFixedDir Properties

A fixed direction in UV-space. The parameter will drive
 the segment's angle relative to this direction.